# IsValidThickness Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..IsValidThickness Method
Application Class See Also
---
Checks if the input value is valid to be supplied as a thickness (for an extrusion, or blend, or wall layer, or similar geometric construct).
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public static bool IsValidThickness(
	double thickness
)
```

Visual Basic
---
```text
Public Shared Function IsValidThickness ( _
	thickness As Double _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidThickness(
	double thickness
)
```

# ### Parameters
thickness
    Type: System..::..Double The input value.
# ### Return Value
True if the input value is valid for thickness; false otherwise.
# Remarks
This checks two conditions:
  * The value is greater than or equal to the minimum thickness allowed in Revit for these types of geometric constructs.
  * The value is less than or equal to the maximum length/distance allowed by Revit for elements.

# See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace